# DividedPathCannotBeMirroredWithoutItsCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedPathFailures..::..DividedPathCannotBeMirroredWithoutItsCurves Property
BuiltInFailures..::..DividedPathFailures Class See Also
---
Divided path cannot be mirrored without its curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedPathCannotBeMirroredWithoutItsCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedPathCannotBeMirroredWithoutItsCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedPathCannotBeMirroredWithoutItsCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedPathFailures Class
Autodesk.Revit.DB Namespace